{
    "domain": "tdw",
    "experiment": "static_detection",
    "S3_BUCKET": "tdw-scenes",
    "S3_ROOT": "https://tdw-scenes.s3.us-east-2.amazonaws.com",
    "db_name": "psychophys",
    "col_name": "tdw_static_detection_bbox_v1",
    "trial_data": ["tdw_detection_pilot_batch_0.json"],  
    "experiment_trial_type": "plugin-probe-detection-task",     
    "random_seed": 30,
    "num_practice_trials": 5,
    "instructions": [
        "<p>Welcome to our experiment! To continue reading the instructions please hit the right arrow key, or press 'Next'.</p>",
        "<p>This experiment should take a total of <strong>15 minutes</strong>. </br></br> You will be compensated at a base rate of $15/hour for a total of $3.75, which you will receive as long as you complete the study.</p>",
        "<p>We take your compensation and time seriously! The main experimenter's email for this experiment is <a href='mailto:yyf@mit.edu'>yyf@mit.edu</a>. </br></br> Please write this down now, and email us with your Prolific ID and the subject line <i>Human experiment compensation for detection experiment</i> if you have problems submitting this task, or if it takes much more time than expected.</p>",
        "<p>In this experiment, you will be asked to look at images and determine if a red dot (a probe) is touching an object. The objects in question are household objects - toys, furniture, appliances, etc...</p>",
        "<p>If you determine that the probe dot <i>is</i> touching an object, you will be asked to <strong>draw a rectangle (called a bounding box) around the object the dot is touching</strong>. To draw, simply click and drag. Bounding boxes can be redrawn as many times as you would like before continuing, but once you click 'Submit' your answer will be recorded, and cannot be changed. In the example trial below, the probe is touching the red chair, so you would click 'Yes' and draw a box around the chair. <br><img width=500, height=500, src='https://tdw-scenes.s3.us-east-2.amazonaws.com/media/static-detection/tdw-YES-trial.gif'</img><p>",
        "<p>Objects will be sitting on a colorful square in the middle of the room. For the purposes of this experiment, anything outside that square - doors, windows, things outside - <strong>don't</strong> count as objects. In the example below, the probe <strong>is not </strong> touching an object, so the correct answer is 'No'. <br><img width=500, height=500, src='https://tdw-scenes.s3.us-east-2.amazonaws.com/media/static-detection/tdw-NO-trial.gif'></img></p>", 
        "<p>In some cases, the object might be a <strong>collection of related items</strong>, like a plate of fruit, or a computer workstation. In those cases, the correct bounding box should outline all the parts of the object. In the example below, the dot is touching a computer workstation, so the correct rectangle should include the entire workstation: <br><img width=500, height=500, src='https://tdw-scenes.s3.us-east-2.amazonaws.com/media/static-detection/tdw-group-object.png'></img></p>", 
        "<p>In this example, the dot is touching a banana which is part of <i>a plate of fruit</i>. The correctly drawn box would highlight the entire plate of fruit, as shown below. Don't worry about this too much! If you draw a box around just the banana in a trial like this, you won't be penalized. In cases where you're not sure, draw a box around whatever object you think makes the most sense. <br><img height=500 width=500 src='https://tdw-scenes.s3.us-east-2.amazonaws.com/media/static-detection/tdw-group-object2.png'></img>",
        "<p>Bonuses will be awarded based on two factors. The number of correct responses, and how closely your bounding boxes match the <i>correct</i> object boundaries. Boxes that are drawn in the wrong area, or clearly don't outline the correct object will be disqualified. If more than half of the trials are incorrect, your submission can also be disqualified. </p>",
        "<p>Ready? There will be 5 practice trials before you start, and then the experiment will begin.</p><p>Once you click to continue, you won't be able to review any of the instructions.</p><p>To review any of the instructions now, just hit the back arrow to return to a previous page.</p>"
     ]
}