{
    "domain": "gestalt",
    "experiment": "static_detection_bbox",
    "S3_BUCKET": "gestalt-scenes",
    "S3_ROOT": "https://gestalt-scenes.s3.us-east-2.amazonaws.com",
    "db_name": "psychophys",
    "col_name": "gestalt_static_detection_bbox_v1",
    "experiment_trial_type": "plugin-2afc-task",
    "data_path": "stimuli/",
    "data_name": "gestalt_static_2afc_batch_",
    "n_total_batches": 10,
    "random_seed": null,
    "completion_code": "6713F83E",
    "num_practice_trials": 3,
    "instructions": [
        "<p>Welcome to our experiment! To continue reading the instructions please hit the right arrow key.</p>",
        "<p>Welcome to this experiment. This experiment should take a total of <strong>15 minutes</strong>. </br></br> You will be compensated at a base rate of $15/hour for a total of $3.75, which you will receive as long as you complete the study.</p>",
        "<p>We take your compensation and time seriously! The main experimenter's email for this experiment is <a href='mailto:yyf@mit.edu'>yyf@mit.edu</a>. </br></br> Please write this down now, and email us with your Prolific ID and the subject line <i>Human experiment compensation for detection experiment</i> if you have problems submitting this task, or if it takes much more time than expected.</p>",
        "<p>In this experiment, you will be asked to determine whether or not a red dot is touching an object.\nDuring the experiment, objects will be camouflaged against the background. The objects in question are simple, 3D shapes, \n and when they're not camouflaged, look like these shapes: <br><br> \n<img height=450, width=800, src='https://gestalt-scenes.s3.us-east-2.amazonaws.com/experiment_media/static_detection/all_stims.gif'></img></p>",
        "<p>Objects can appear anywhere in a scene. If the center (red part) of a dot is touching an object, click 'Yes', and draw a box around visible part of the object it is touching. For example, on the example trial below, the dot is touching an object so the answer is 'Yes'. <br> <br>After clicking yes, use your mouse to click and drag to draw a box around that object, and hit 'Submit' to continue. <br> <br> You can redraw a bounding box to adjust it as many times as you want before continuing.</p>", 
        "<p>While it doesn't need to be perfect, try and make the box you draw fit the object (ie; try not to leave too much space on the outside).</p>",
        "<p>Sometimes an object isn't fully visible, like if it's blocked by another object in front of it. In those cases, just draw a box around the visible portion of the object that the dot is touching.</p>", 
        "<p>Here you can see an example trial, where the shape is not occluded at all: <br>  <img src='https://gestalt-scenes.s3.us-east-2.amazonaws.com/experiment_media/static_detection/example_trial.gif' width=500, height=500></img></p>",
        "<p>Bonuses will be awarded based on two factors. The number of correct responses, and whether the bounding boxes you draw accurately outline the object.</p>",
        "<p>In the example below, the dot is not touching an object, so we can simply click 'No' and move on.<br><br> <video src = 'https://gestalt-scenes.s3.us-east-2.amazonaws.com/experiment_media/static_detection/gestalt-example-no-trial.gif' width=500, height=500> </img> </p>",
        "<p>Ready? There will be one practice trial on the next page, and then the experiment will begin.</p><p>Once you click to continue, you won't be able to review any of the instructions.</p><p>To review any of the instructions now, just hit the back arrow to return to a previous page.</p>"
      ]
}
